FemDesign.Reinforcement.PtcShapeType
Defines the shape of a post-tensioned cable (PTC) element.

FemDesign.Reinforcement.PtcShapeType.#ctor
Private constructor for serialization

FemDesign.Reinforcement.PtcShapeType.#ctor(FemDesign.Reinforcement.PtcShapeStart,FemDesign.Reinforcement.PtcShapeEnd,System.Collections.Generic.IEnumerable{FemDesign.Reinforcement.PtcShapeInner})
Defines the shape of a Post Tensioned Cable.

FemDesign.Reinforcement.PtcShapeType.DenormalizePriorInflectionParameters(FemDesign.Reinforcement.PtcShapeEnd@,System.Collections.Generic.IEnumerable{FemDesign.Reinforcement.PtcShapeInner}@)
Change normalization on PriorInflectionPosition from normalized along parent element to be normalized between ptc shape base points.
end:
intermediates: